def numRookCaptures(board):
    """
    问题描述：在一个 8 x 8 的棋盘上，有一个白色车（rook）。也可能有空方块，白色的象（bishop）和
    黑色的卒（pawn）。它们分别以字符 “R”，“.”，“B” 和 “p” 给出。大写字符表示白棋，小写字符表示黑棋。
    车按国际象棋中的规则移动：它选择四个基本方向中的一个（北，东，西和南），然后朝那个方向移动，直到
    它选择停止、到达棋盘的边缘或移动到同一方格来捕获该方格上颜色相反的卒。另外，车不能与其他友方（白色）象
    进入同一个方格。
    返回车能够在一次移动中捕获到的卒的数量。
    解决思路：先找到车的位置， 再在其位置的上下左右四个方向上判断
    :param board:
    :return:
    """
    for i in range(8):
        for j in range(8):
            if board[i][j] == "R":
                x0, y0 = i, j
    res = 0
    for i, j in ((1, 0), (0, 1), (-1, 0), (0, -1)):
        x, y = x0 + i, y0 + j
        while 0 <= x < 8 and 0 <= y < 8:
            if board[x][y] == 'p': res += 1
            if board[x][y] != '.': break
            x, y = x + i, y + j
    return res


if __name__ == "__main__":
    test_arr = [[".",".",".",".",".",".",".","."],[".",".",".","p",".",".",".","."],
                [".",".",".","p",".",".",".","."],["p","p",".","R",".","p","B","."],
                [".",".",".",".",".",".",".","."],[".",".",".","B",".",".",".","."],
                [".",".",".","p",".",".",".","."],[".",".",".",".",".",".",".","."]]
    print(numRookCaptures(test_arr))
